
{
"pioneers": [
    {
        "id": "1",
        "name": "Donald Campbell",
        "details": "The creator of Locking, He invented the Campbellock, better known as locking, an idiosyncratic style that became one of the first street dances to gain widespread attention. Locking a style that eventually permeated hip-hop dance, He locked his joints and froze for an instant, dramatically accentuating the dance and captivating his spectators. Originator, without him non of us would have the joy to practise and enjoy the dance locking.",
        "steps": "The Lock, Pacing, Hand slaps, Campbell-walk, Splits",
        "image": "./images/web_don.png"
    },
    {
        "id": "2",
        "name": "Fred Berry",
        "details": "Fred “ Rerun” Berry that Funny actor from the 1970’s sitcom Whats Happening” Some Know him as “Mr. Penguin” the entertaining Dancer in the Group The Lockers, but we at Lockerlegends know him as simply “Ping” a friend and companion .A person who reached and helped a lot of people in his desire and struggle to show the world that his weight was no barrier but an asset which he used gracefully, weather he had one dollar or thousands he was the one dancer who would share his last. I have never read or heard of an article where he has talked negatively about the brotherhood of locking. To a true Giant of the Artform we will always miss your your smile and laughter. Every time we hear thunder we will think of Penguin landing one of his master butt drops in heaven",
        "steps": "The Helicopter, slow-motion",
        "image": "./images/web_fred.png"
    },
    {
        "id": "3",
        "name": " Adolfo Quiñones",
        "details": "Was known professionally as Shabba Doo, was an American actor, great dancer, and choreographer of African American and Puerto Rican descent. Quiñones is perhaps best known for his role as Orlando 'Ozone' in the 1984 breakdancing film Breakin' and its sequel, Breakin' 2: Electric Boogaloo. He was a member of The Lockers and helped spread locking worldwide",
        "steps": "Sway",
        "image": "./images/web_shab.png"
    },
    {
        "id": "4",
        "name": "Dave Gregory Pope",
        "details": "When Lockerlegends first launched this website in 2004. It was the brainchild of Three Locking pioneers. One of them was Greg Campbellock Jr. Pope.It was his goal to help expose the world not only to Locking but to the many contributors and contributing factors that influenced this dance from its inception. during many of his workshops he promoted and taught many of the concepts and history displayed , Greg was not only an awsome dancer & choreographer. We at Lockerlegnds Lost a friend and a pioneer for the correction and truth of the Locking Legacy",
        "steps": "Quicked / Stop n Go, Sneek/Seek",
        "image": "./images/web_greg.png"
    },
    {
        "id": "5",
        "name": "James Brown",
        "details": " The Godfather of Soul, James brown was the spearhead of the funk movement 'say it loud im black and im proud' this song sung live on soul train in 1972, This song not only was the cry for the social movement but became the theme for the street dance movement, in the clip you see Locking by various pioneers of streetdance, but not just locking , but Locking with a purpose and a cause",
        "steps": "God father of soul",
        "image": "./images/web_theboss.png"
    },
    {
        "id": "6",
        "name": "Aretha Franklin",
        "details": "Was an American singer, songwriter and pianist. Referred to as the 'Queen of Soul', she has twice been placed ninth in Rolling Stone's  Greatest Artists of All Time'. With global sales of over 75 million records, Franklin is one of the world's best-selling music artists",
        "steps": "God Mother of soul",
        "image": "./images/web_aretha.png"
    },
    {
        "id": "7",
        "name": "Don Cornelius",
        "details": "Host and producer of the Dance Show “Soul Train” This is the show that opened the door for america to see inside the creative , soulful musical and dance world of African Americans",
        "steps": "Soul Train",
        "image": "./images/web_doncorne.png"
    },
    {
        "id": "8",
        "name": "Prince",
        "details": "'The Prince' was an American singer-songwriter and multi-instrumentalist. Widely regarded as one of the greatest musicians of his generation, he was known for his flamboyant, androgynous persona and wide vocal range, which included a far-reaching falsetto and high-pitched screams. Prince produced his albums himself, pioneering the Minneapolis sound. His music incorporated a wide variety of styles, including funk, R&B, rock, new wave, soul, synth-pop, pop, jazz, and hip hop. He often played most or all instruments on his recordings",
        "steps": "The Prince",
        "image": "./images/web_prince.png"
    },
    {
        "id": "9",
        "name": "Michael Jackson",
        "details": "'King of Pop' contributed to the entertainment world of music goes beyond discription, It is not only what he ment to us as a musical artist, But also what he ment to us as a dancer who took to the world the rythem and passion which was taking place on the streets and in the cities accross America, Micheal has become and inspiration to millions. Without Micheal what we see done today on the floors of dance studios, stages and screens, would have been stuck in dark streetcorners and apartments, seen by a few, His quick spins, and glides, along with his interpretation of dances like Locking and popping set the world on fire. He was a tremendous influence on the world, his concepts of brotherhood and unity, coincided with the mission of our beloved Artform of Locking, and its streetdance influence on Micheal is never more evident, than the video below in which the Jackson 5, display there rendition of locking , we were never more proud than to see the king of Pop, gracefully tribute steps",
        "steps": "King of Pop",
        "image": "./images/web_mj.png"
    }
]

}